controllers/EventsController.php

    public function actionCreate()
    {
        $events = $this->getValidatedEventsFromPost();
        $organizators = $this->getValidatedOrganizatorsFromPost();

        if (!$this->request->isPost) {
            return $this->render('create', [
                'events' => $events,
                'organizators' => $organizators,
            ]);
        }

        if ($events && $organizators) {
            if ($events->save(false)) {
                foreach ($organizators as $organizator) {
                    $isNewRecord = $organizator->isNewRecord;
                    $organizator->save(false);
---
INSERT INTO `events` (`id`, `title`, `date`, `description`) VALUES (NULL, 'Новое мероприятие 3', '2015-01-27 05:25', 'dwdvwdv')
INSERT INTO `organizators` (`id`) VALUES (NULL)

            //}


            if ($events->save(false)) {
---
UPDATE `events` SET `id`=5, `title`='ehwethw' WHERE `id`=5