models/OrganizatorsQuery.php

SELECT * FROM `organizators` WHERE 0=1
---
    public function all($db = null)
    {
        return parent::all($db);